import os
import shutil

def solve():
    """
    Задание 3: Группировка файлов по первой букве
    
    В папке `tasks/data_for_task_3` лежит много файлов. 
    Вам нужно написать скрипт, который сгруппирует их по первой букве имени.
    1.  Для каждой буквы алфавита, с которой начинается хотя бы один файл, нужно создать папку с этой буквой (например, `A`, `B`, `C`...). Папки должны быть в верхнем регистре.
    2.  Переместить каждый файл в соответствующую ему папку.
    *   Пример: файл `apple.txt` должен быть перемещен в папку `A`, а `Bear.jpg` — в папку `B`.
    """
    pass