def solve():
    """
    Задание 4: Сбор информации о файлах
    
    В папке `tasks/data_for_task_4` лежат файлы разных размеров. 
    Вам нужно написать код, который проанализирует эту папку и вернет из функции `solve()` словарь, где:
    *   Ключи — это строки: `'small'`, `'medium'`, `'large'`.
    *   Значения — это количество файлов, попадающих в соответствующую категорию.
    *   Критерии размера:
    *   `small`: размер файла <= 100 байт.
    *   `medium`: 100 байт < размер файла <= 100 байт.
    *   `large`: размер файла > 1000 байт.
    *   Подсказка: Чтобы узнать размер файла, используйте `os.path.getsize(path_to_file)`.
    """
    pass
